[IRI_Flamethrower_TLE X2WeaponTemplate]
FriendlyName="Flametorch"
FriendlyNamePlural="Flametorch"
BriefSummary="A simple mechanical incendiary device, mostly unchanged in design since the 20th century. With little room for improvement in terms of weapon attachments, its simplicity makes it an effective and affordable weapon of psychological warfare."
TacticalText="A simple mechanical incendiary device, mostly unchanged in design since the 20th century. With little room for improvement in terms of weapon attachments, its simplicity makes it an effective and affordable weapon of psychological warfare.<br/><Bullet/> The Flametorch provides a limited-range cone of fire.\n<Bullet/>Use with caution, as it can burn friend and foe alike.\n<Bullet/> Canisters with diverse chemical agents can provide added versatility."
AbilityDescName="Flametorch"